[NoCoverage] BlockStatement
src/components/app/app.tsx:11:51
 
 // const SVGIconComponent = React.lazy(() => import("@components/icons"));
 
-export const App: React.FunctionComponent = () => {
-  return (
-    <div className={stylesContainer}>
-      <div className={stylesHeader}>Gratuliere Comrades, It is working pretty well.</div>
-
-      <div>
-        {/*<img src={image} className={stylesImage} alt="yee-haw" />*/}
-        <Icon iconSource={StrawberryIcon} className={stylesImage} />
-        <a className={classNames(stylesLink)} href="https://github.com/glook/webpack-typescript-react" target="_blank">
-          &nbsp;
-        </a>
-        {/*<React.Suspense fallback={"loading..."}>*/}
-        {/*  <SVGIconComponent name="strawberry" className={stylesImage} />*/}
-        {/*</React.Suspense>*/}
-      </div>
-    </div>
-  );
-};
+export const App: React.FunctionComponent = () => {};
 
 // sphere
