[NoCoverage] BlockStatement
src/components/icons/icon-comp.tsx:39:102
 
 // export default SVGIconComponent;
 
-export const Icon: React.FunctionComponent<Props> = ({ iconSource: IconComponent, ...restProps }) => {
-  return IconComponent ? <IconComponent {...restProps} /> : null;
-};
+export const Icon: React.FunctionComponent<Props> = ({ iconSource: IconComponent, ...restProps }) => {};
 
