[NoCoverage] ArrowFunction
scoreboard/components/counter/counter.tsx:5:67
 
 import styles from "./counter.module.scss";
 
-export const Counter: FunctionComponent<{ itemNumber: string }> = ({ itemNumber }) => (
-  <div className={styles.parentCounter}>{itemNumber}</div>
-);
+export const Counter: FunctionComponent<{ itemNumber: string }> = () => undefined;
 
