[NoCoverage] ArrowFunction
scoreboard/components/level/level.tsx:5:66
 
 import styles from "./level.module.scss";
 
-export const Level: FunctionComponent<{ levelData: string[] }> = ({ levelData }) => (
-  <select className={styles.selectLevel}>
-    {levelData.map((item: string) => {
-      return (
-        <option className={styles.optionLevel} key={item}>
-          {item}
-        </option>
-      );
-    })}
-  </select>
-);
+export const Level: FunctionComponent<{ levelData: string[] }> = () => undefined;
 

[NoCoverage] BlockStatement
scoreboard/components/level/level.tsx:7:38
 
 export const Level: FunctionComponent<{ levelData: string[] }> = ({ levelData }) => (
   <select className={styles.selectLevel}>
-    {levelData.map((item: string) => {
-      return (
-        <option className={styles.optionLevel} key={item}>
-          {item}
-        </option>
-      );
-    })}
+    {levelData.map((item: string) => {})}
   </select>
 );
