[NoCoverage] BlockStatement
src/components/scoreboard/scoreboard.tsx:25:101
   mines: string;
 }
 
-export const ScoreBoard: FunctionComponent<ScoreboardProps> = ({ time, mines, onReset, levels }) => {
-  return (
-    <div className={styles.wrapperScoreboard}>
-      <Counter itemNumber={time} />
-      <Level levelData={levels} />
-      <ResetButton onReset={onReset} />
-      <Counter itemNumber={mines} />
-    </div>
-  );
-};
+export const ScoreBoard: FunctionComponent<ScoreboardProps> = ({ time, mines, onReset, levels }) => {};
 
