[NoCoverage] BlockStatement
components/top-section/legend/index.tsx:20:99
   secondAction?: string;
 }
 
-export const Legend: FunctionComponent<LegendProps> = ({ feature, secondAction, firstAction }) => {
-  return (
-    <legend className={styles.legendParent}>
-      <strong>{feature}: </strong>
-      <code className={styles.flagComboParent}>
-        <span className={styles.firstAction}>{firstAction}</span>
-        {secondAction ? <span className={styles.secondAction}> + {secondAction}</span> : null}
-      </code>
-    </legend>
-  );
-};
+export const Legend: FunctionComponent<LegendProps> = ({ feature, secondAction, firstAction }) => {};
 
