[NoCoverage] BlockStatement
src/components/top-section/top.tsx:6:116
 
 import styles from "./top.module.scss";
 
-export const Top: FunctionComponent<PropsWithChildren<LegendProps>> = React.memo(({ children, ...legendProps }) => {
-  return (
-    <header className={styles.headerContainer}>
-      <h1 className={styles.gameName}>{children}</h1>
-      <Legend {...legendProps} />
-    </header>
-  );
-});
+export const Top: FunctionComponent<PropsWithChildren<LegendProps>> = React.memo(({ children, ...legendProps }) => {});
 
