[NoCoverage] ArrowFunction
project-2022/minesweeper/src/index.tsx:29:62
       {/*</Top>*/}
       {/*<ScoreBoard time="000" onReset={() => null} levels={["beginner", "intermediate", "expert"]} mines="010" />*/}
       {/*<CellComponent coords={[1, 1]} children={10} onContextMenu={() => null} onClick={() => null} />*/}
-      <GridComponent children={MockFieldData} onContextMenu={() => null} onClick={() => null} />
+      <GridComponent children={MockFieldData} onContextMenu={() => undefined} onClick={() => null} />
     </>
     {/*</Segment>*/}

[NoCoverage] ArrowFunction
project-2022/minesweeper/src/index.tsx:29:83
       {/*</Top>*/}
       {/*<ScoreBoard time="000" onReset={() => null} levels={["beginner", "intermediate", "expert"]} mines="010" />*/}
       {/*<CellComponent coords={[1, 1]} children={10} onContextMenu={() => null} onClick={() => null} />*/}
-      <GridComponent children={MockFieldData} onContextMenu={() => null} onClick={() => null} />
+      <GridComponent children={MockFieldData} onContextMenu={() => null} onClick={() => undefined} />
     </>
     {/*</Segment>*/}
