[Killed] ObjectLiteral
src/helpers/field/field.ts:7:48
 export type Field = Cell[][];
 export type Coordinates = [number, number];
 
-export const CellState: Record<string, Cell> = {
-  empty: 0,
-  bomb: 9,
-  hidden: 10,
-  mark: 11,
-  weakMark: 12,
-};
+export const CellState: Record<string, Cell> = {};
 
 /**
killedBy: Check Increment Neighbours on each cells Simple Cases should have Field with size 2x2 with one mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      undefined,

[Killed] ArrowFunction
src/helpers/field/field.ts:28:46
  * @param {Cell} state
  * @returns {Field}
  */
-export const generateFieldWithDefaultState = (size: number, state: Cell = CellState.empty): Field =>
-  new Array(size).fill(null).map(() => new Array(size).fill(state));
+export const generateFieldWithDefaultState = () => undefined;
 
 /**
killedBy: Field Generator emptyFieldGenerator tests should go with 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[0, 0], [0, 0]]
Received: undefined

[Killed] ArrowFunction
src/helpers/field/field.ts:29:34
  * @returns {Field}
  */
 export const generateFieldWithDefaultState = (size: number, state: Cell = CellState.empty): Field =>
-  new Array(size).fill(null).map(() => new Array(size).fill(state));
+  new Array(size).fill(null).map(() => undefined);
 
 /**
killedBy: Field Generator emptyFieldGenerator tests should go with 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 2

  Array [
-   Array [
-     0,

[Killed] EqualityOperator
src/helpers/field/field.ts:51:7
  * @return {Field}
  */
 export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
+  if (probability >= 0 || probability > 1) {
     throw new Error("Probability must be between 0 and 1");
   }
killedBy: Field Generator Simple Case should throw wrong density
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Probability must be between 0 and 1"

Received function did not throw

[Killed] ArithmeticOperator
src/helpers/field/field.ts:58:26
   const result: Field = generateFieldWithDefaultState(size);
 
   // the size grid of the cells
-  let unprocessedCells = size * size;
+  let unprocessedCells = size / size;
   // cells filled with bombs
   let restCellsWithBombs = unprocessedCells * probability;
killedBy: Field Generator Simple Case should have 2x2 field with mines(bomb)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ArithmeticOperator
src/helpers/field/field.ts:60:28
   // the size grid of the cells
   let unprocessedCells = size * size;
   // cells filled with bombs
-  let restCellsWithBombs = unprocessedCells * probability;
+  let restCellsWithBombs = unprocessedCells / probability;
 
   /**
killedBy: Field Generator Simple Case should have a smallest possible field without mine(bomb)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     0,

[Killed] ConditionalExpression
src/helpers/field/field.ts:69:11
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
       // Stryker disable next-line EqualityOperator
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
+      if (false) {
         result[y][x] = CellState.bomb;
         incrementNeighbours([y, x], result);
killedBy: Field Generator Simple Case should have a smallest possible field with mine(bomb)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,
