[Killed] BlockStatement
src/hooks/useMouseDown/index.tsx:6:84
 export type SetMouseDownStatus = () => void;
 export type SetMouseUpStatus = () => void;
 
-export const useMouseDown = (): [boolean, SetMouseDownStatus, SetMouseUpStatus] => {
-  const [mouseDown, setMouseDown] = useState(false);
-
-  // useDebugValue(`mouseDown: ${mouseDown}`, (str) => `${str} ${new Date().toDateString()}`);
-
-  const onMouseDown = useCallback(
-    () => setMouseDown(true),
-    // Stryker disable next-line ArrayDeclaration
-    []
-  );
-  const onMouseUp = useCallback(
-    () => setMouseDown(false),
-    // Stryker disable next-line ArrayDeclaration
-    []
-  );
-
-  return [mouseDown, onMouseDown, onMouseUp];
-};
+export const useMouseDown = (): [boolean, SetMouseDownStatus, SetMouseUpStatus] => {};
 
killedBy: Reset button test should render elements with default state
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.
