[Killed] ArrowFunction
components/grid/cell/cell.tsx:43:29
 
 type ExcludeMouseDown = Omit<ComponentsMapProps, "mouseDown">;
 
-export const isActiveCell = (cell: CellType): boolean =>
-  [CellState.hidden, CellState.mark, CellState.weakMark].includes(cell);
+export const isActiveCell = () => undefined;
 
 export const areEqual = (prevProps: CellProps, nextProps: CellProps): boolean => {
killedBy: Testing the CELL component onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: [1, 1]

[Killed] BlockStatement
components/grid/cell/cell.tsx:46:82
 export const isActiveCell = (cell: CellType): boolean =>
   [CellState.hidden, CellState.mark, CellState.weakMark].includes(cell);
 
-export const areEqual = (prevProps: CellProps, nextProps: CellProps): boolean => {
-  const areEqualCoords = prevProps.coords.filter((coord, index) => nextProps.coords[index] !== coord).length === 0;
-
-  return (
-    prevProps.children === nextProps.children &&
-    areEqualCoords &&
-    prevProps.onClick === nextProps.onClick &&
-    prevProps.onContextMenu === nextProps.onContextMenu
-  );
-};
+export const areEqual = (prevProps: CellProps, nextProps: CellProps): boolean => {};
 
 export const CellComponent: FunctionComponent<CellProps> = ({ coords, children, ...restProps }) => {
killedBy: Testing the CELL component Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArrowFunction
components/grid/cell/cell.tsx:47:50
   [CellState.hidden, CellState.mark, CellState.weakMark].includes(cell);
 
 export const areEqual = (prevProps: CellProps, nextProps: CellProps): boolean => {
-  const areEqualCoords = prevProps.coords.filter((coord, index) => nextProps.coords[index] !== coord).length === 0;
+  const areEqualCoords = prevProps.coords.filter(() => undefined).length === 0;
 
   return (
killedBy: Testing the CELL component Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
components/grid/cell/cell.tsx:47:68
   [CellState.hidden, CellState.mark, CellState.weakMark].includes(cell);
 
 export const areEqual = (prevProps: CellProps, nextProps: CellProps): boolean => {
-  const areEqualCoords = prevProps.coords.filter((coord, index) => nextProps.coords[index] !== coord).length === 0;
+  const areEqualCoords = prevProps.coords.filter((coord, index) => true).length === 0;
 
   return (
killedBy: Testing the CELL component Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
components/grid/cell/cell.tsx:50:5
   const areEqualCoords = prevProps.coords.filter((coord, index) => nextProps.coords[index] !== coord).length === 0;
 
   return (
-    prevProps.children === nextProps.children &&
-    areEqualCoords &&
-    prevProps.onClick === nextProps.onClick &&
-    prevProps.onContextMenu === nextProps.onContextMenu
+    true
   );
 };
killedBy: Testing the CELL component Check areEqual
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
components/grid/cell/cell.tsx:60:19
 export const CellComponent: FunctionComponent<CellProps> = ({ coords, children, ...restProps }) => {
   const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
 
-  const onClick = () => restProps.onClick(coords);
+  const onClick = () => undefined;
 
   const onContextMenu = (event: React.MouseEvent<HTMLDivElement>) => {
killedBy: Testing the CELL component onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
components/grid/cell/cell.tsx:62:70
 
   const onClick = () => restProps.onClick(coords);
 
-  const onContextMenu = (event: React.MouseEvent<HTMLDivElement>) => {
-    /**
-     * Prevent context menu by default
-     */
-    event.preventDefault();
-
-    if (isActiveCell(children)) {
-      restProps.onContextMenu(coords);
-    }
-  };
+  const onContextMenu = (event: React.MouseEvent<HTMLDivElement>) => {};
 
   const props = {
killedBy: Testing the CELL component Check prevent default contextMenu for every type of cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
components/grid/cell/cell.tsx:68:33
      */
     event.preventDefault();
 
-    if (isActiveCell(children)) {
-      restProps.onContextMenu(coords);
-    }
+    if (isActiveCell(children)) {}
   };
 
killedBy: Testing the CELL component onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
components/grid/cell/cell.tsx:88:45
 };
 
 export const ComponentsMap: FunctionComponent<ComponentsMapProps> = ({ children, ...rest }) => {
-  const nonActiveCellProps: RevealedProps = {
-    onContextMenu: rest.onContextMenu,
-    "data-testid": rest["data-testid"],
-    role: rest.role,
-  };
+  const nonActiveCellProps: RevealedProps = {};
 
   switch (children) {
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 1`

- Snapshot  - 2
+ Received  + 0

  <DocumentFragment>

[Killed] ConditionalExpression
components/grid/cell/cell.tsx:95:5
   };
 
   switch (children) {
-    case CellState.bomb:
-      return (
-        <BombFrame {...nonActiveCellProps}>
-          <div className={styles.bombEntity} data-testid={`bomb_${rest["data-testid"]}`} />
-        </BombFrame>
-      );
+    case CellState.bomb:
     case CellState.mark:
       return (
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 10`

- Snapshot  - 3
+ Received  + 3

  <DocumentFragment>

[Killed] ConditionalExpression
components/grid/cell/cell.tsx:101:5
           <div className={styles.bombEntity} data-testid={`bomb_${rest["data-testid"]}`} />
         </BombFrame>
       );
-    case CellState.mark:
-      return (
-        <ClosedFrame {...rest}>
-          <FlagComponent data-testid={`flag_${rest["data-testid"]}`} />
-        </ClosedFrame>
-      );
+    case CellState.mark:
 
     case CellState.weakMark:
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 12`

- Snapshot  - 2
+ Received  + 2

@@ -3,10 +3,10 @@

[Killed] StringLiteral
components/grid/cell/cell.tsx:104:39
     case CellState.mark:
       return (
         <ClosedFrame {...rest}>
-          <FlagComponent data-testid={`flag_${rest["data-testid"]}`} />
+          <FlagComponent data-testid={``} />
         </ClosedFrame>
       );
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 12`

- Snapshot  - 1
+ Received  + 1

@@ -4,9 +4,9 @@

[Killed] StringLiteral
components/grid/cell/cell.tsx:104:52
     case CellState.mark:
       return (
         <ClosedFrame {...rest}>
-          <FlagComponent data-testid={`flag_${rest["data-testid"]}`} />
+          <FlagComponent data-testid={`flag_${rest[""]}`} />
         </ClosedFrame>
       );
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 12`

- Snapshot  - 1
+ Received  + 1

@@ -4,9 +4,9 @@

[Killed] ConditionalExpression
components/grid/cell/cell.tsx:108:5
         </ClosedFrame>
       );
 
-    case CellState.weakMark:
-      return (
-        <ClosedFrame {...rest}>
-          <WeakFlagComponent data-testid={`weakFlag_${rest["data-testid"]}`} />
-        </ClosedFrame>
-      );
+    case CellState.weakMark:
     case CellState.hidden:
       return <ClosedFrame {...rest} />;
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 13`

- Snapshot  - 5
+ Received  + 0

  <DocumentFragment>

[Killed] BlockStatement
components/grid/cell/cell.tsx:125:7
   mouseDown,
   children,
   ...restProps
-}) => {
-  return (
-    <div
-      {...(restProps as ExcludeMouseDown)}
-      className={classNames(styles.closedFrame, {
-        [styles.changedBorderColor]: !mouseDown,
-        [styles.transparentClosedFrame]: mouseDown,
-      })}
-    >
-      {children ?? null}
-    </div>
-  );
-};
+}) => {};
 
 export const RevealedFrame: FunctionComponent<PropsWithChildren<RevealedProps>> = ({ children, ...restProps }) => {
killedBy: Testing the CELL component Closed Frame renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Closed Frame renders correct 1`

- Snapshot  - 5
+ Received  + 1

- <DocumentFragment>

[Killed] BooleanLiteral
components/grid/cell/cell.tsx:130:38
     <div
       {...(restProps as ExcludeMouseDown)}
       className={classNames(styles.closedFrame, {
-        [styles.changedBorderColor]: !mouseDown,
+        [styles.changedBorderColor]: mouseDown,
         [styles.transparentClosedFrame]: mouseDown,
       })}
killedBy: Testing the CELL component Closed Frame renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Closed Frame renders correct 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] LogicalOperator
components/grid/cell/cell.tsx:134:8
         [styles.transparentClosedFrame]: mouseDown,
       })}
     >
-      {children ?? null}
+      {children && null}
     </div>
   );
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 12`

- Snapshot  - 5
+ Received  + 0

  <DocumentFragment>

[Killed] BlockStatement
components/grid/cell/cell.tsx:139:115
   );
 };
 
-export const RevealedFrame: FunctionComponent<PropsWithChildren<RevealedProps>> = ({ children, ...restProps }) => {
-  return (
-    <div
-      {...(restProps as ExcludeMouseDown)}
-      className={classNames(styles.closedFrame, styles.revealedFrame)}
-      style={{
-        color: colors[children as CellType] ?? transparent,
-      }}
-    >
-      {children}
-    </div>
-  );
-};
+export const RevealedFrame: FunctionComponent<PropsWithChildren<RevealedProps>> = ({ children, ...restProps }) => {};
 
 export const BombFrame: FunctionComponent<{ children: ReactNode }> = ({ children, ...restProps }) => {
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 1`

- Snapshot  - 10
+ Received  +  1

- <DocumentFragment>

[Killed] LogicalOperator
components/grid/cell/cell.tsx:145:16
       {...(restProps as ExcludeMouseDown)}
       className={classNames(styles.closedFrame, styles.revealedFrame)}
       style={{
-        color: colors[children as CellType] ?? transparent,
+        color: colors[(children as CellType)] && transparent,
       }}
     >
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 2`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] BlockStatement
components/grid/cell/cell.tsx:153:102
   );
 };
 
-export const BombFrame: FunctionComponent<{ children: ReactNode }> = ({ children, ...restProps }) => {
-  return (
-    <div
-      {...(restProps as ExcludeMouseDown)}
-      className={classNames(styles.closedFrame, styles.revealedFrame, styles.bombFrame)}
-    >
-      {children}
-    </div>
-  );
-};
+export const BombFrame: FunctionComponent<{ children: ReactNode }> = ({ children, ...restProps }) => {};
 
 const FlagComponent: FunctionComponent = ({ ...restProps }) => {
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 10`

- Snapshot  - 12
+ Received  +  1

- <DocumentFragment>

[Killed] BlockStatement
components/grid/cell/cell.tsx:164:64
   );
 };
 
-const FlagComponent: FunctionComponent = ({ ...restProps }) => {
-  return <div {...(restProps as ExcludeMouseDown)} className={styles.flagComponent} />;
-};
+const FlagComponent: FunctionComponent = ({ ...restProps }) => {};
 
 const WeakFlagComponent: FunctionComponent = ({ ...restProps }) => {
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 12`

- Snapshot  - 5
+ Received  + 0

  <DocumentFragment>

[Killed] BlockStatement
components/grid/cell/cell.tsx:168:68
   return <div {...(restProps as ExcludeMouseDown)} className={styles.flagComponent} />;
 };
 
-const WeakFlagComponent: FunctionComponent = ({ ...restProps }) => {
-  return (
-    <div {...(restProps as ExcludeMouseDown)} className={classNames(styles.flagComponent, styles.flagTransparent)} />
-  );
-};
+const WeakFlagComponent: FunctionComponent = ({ ...restProps }) => {};
 
 const transparent = "rgba(0,0,0,0)";
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 13`

- Snapshot  - 5
+ Received  + 0

  <DocumentFragment>

[Killed] ObjectLiteral
components/grid/cell/cell.tsx:175:47
 };
 
 const transparent = "rgba(0,0,0,0)";
-const colors: { [key in CellType]: string } = {
-  0: transparent,
-  1: "#2a48ec",
-  2: "#2bb13d",
-  3: "#ec6561",
-  4: "#233db7",
-  5: "#a6070f",
-  6: "#e400af",
-  7: "#906a02",
-  8: "#fa0707",
-  9: transparent,
-  10: transparent,
-  11: transparent,
-  12: transparent,
-};
+const colors: { [key in CellType]: string } = {};
 
killedBy: Testing the CELL component Cell renders correct
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Testing the CELL component Cell renders correct 2`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>
