[Killed] BlockStatement
src/components/grid/grid.tsx:22:92
   onContextMenu: (coords: Coordinates) => void;
 }
 
-export const GridComponent: FunctionComponent<GridProps> = ({ children, ...restProps }) => {
-  return (
-    <WrapperContainer size={children.length} role="grid">
-      {children.map((row, y) =>
-        row.map((cell, x) => {
-          return <CellComponent key={`${y}_${x}_${cell}`} children={cell} coords={[y, x]} {...restProps} />;
-        })
-      )}
-    </WrapperContainer>
-  );
-};
+export const GridComponent: FunctionComponent<GridProps> = ({ children, ...restProps }) => {};
 
 const WrapperContainer: FunctionComponent<PropsWithChildren<{ size: number; role: string }>> = ({
killedBy: Grid Component rendering test should render the grid correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid Component rendering test should render the grid correctly 1`

- Snapshot  - 1167
+ Received  +    1

- <DocumentFragment>

[Killed] ArrowFunction
src/components/grid/grid.tsx:25:21
 export const GridComponent: FunctionComponent<GridProps> = ({ children, ...restProps }) => {
   return (
     <WrapperContainer size={children.length} role="grid">
-      {children.map((row, y) =>
-        row.map((cell, x) => {
-          return <CellComponent key={`${y}_${x}_${cell}`} children={cell} coords={[y, x]} {...restProps} />;
-        })
+      {children.map(() => undefined
       )}
     </WrapperContainer>
killedBy: Grid Component rendering test should render the grid correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid Component rendering test should render the grid correctly 1`

- Snapshot  - 1160
+ Received  +    0

  <DocumentFragment>

[Killed] BlockStatement
src/components/grid/grid.tsx:26:30
   return (
     <WrapperContainer size={children.length} role="grid">
       {children.map((row, y) =>
-        row.map((cell, x) => {
-          return <CellComponent key={`${y}_${x}_${cell}`} children={cell} coords={[y, x]} {...restProps} />;
-        })
+        row.map((cell, x) => {})
       )}
     </WrapperContainer>
killedBy: Grid Component rendering test should render the grid correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid Component rendering test should render the grid correctly 1`

- Snapshot  - 1160
+ Received  +    0

  <DocumentFragment>

[Survived] StringLiteral
src/components/grid/grid.tsx:27:38
     <WrapperContainer size={children.length} role="grid">
       {children.map((row, y) =>
         row.map((cell, x) => {
-          return <CellComponent key={`${y}_${x}_${cell}`} children={cell} coords={[y, x]} {...restProps} />;
+          return <CellComponent key={``} children={cell} coords={[y, x]} {...restProps} />;
         })
       )}

[Killed] ArrowFunction
src/components/grid/grid.tsx:34:96
   );
 };
 
-const WrapperContainer: FunctionComponent<PropsWithChildren<{ size: number; role: string }>> = ({
-  children,
-  size,
-  role,
-}) => (
-  <div
-    className={styles.containerWrapper}
-    style={{
-      gridTemplateColumns: `repeat(${size}, auto)`,
-    }}
-    role={role}
-  >
-    {children}
-  </div>
-);
+const WrapperContainer: FunctionComponent<PropsWithChildren<{ size: number; role: string }>> = () => undefined;
 
killedBy: Grid Component rendering test should render the grid correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid Component rendering test should render the grid correctly 1`

- Snapshot  - 1167
+ Received  +    1

- <DocumentFragment>
