[Killed] BlockStatement
scoreboard/components/reset/reset.tsx:13:76
   onReset: () => void;
 }
 
-export const ResetButton: FunctionComponent<ResetProps> = ({ onReset }) => {
-  const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
-
-  return (
-    <button
-      className={styles.resetButton}
-      onMouseDown={onMouseDown}
-      onMouseUp={onMouseUp}
-      onMouseLeave={onMouseUp}
-      // onMouseEnter={onMouseDown} not sure if we need this event.
-      onClick={onReset}
-    >
-      {mouseDown ? "😯" : "🙂"}
-    </button>
-  );
-};
+export const ResetButton: FunctionComponent<ResetProps> = ({ onReset }) => {};
 
killedBy: Reset button test should render elements with default state
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name `/🙂/i`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, <script />, <style />
<bod
