[Killed] ArrowFunction
src/helpers/cells/cells-manipulator.ts:8:30
  * @param { Coordinates } coords
  * @return { Record<string, [number, number]>}
  */
-export const getNeighbours = ([y, x]: Coordinates): Record<string, [number, number]> => ({
-  top: [y - 1, x],
-  topRight: [y - 1, x + 1],
-  right: [y, x + 1],
-  rightBottom: [y + 1, x + 1],
-  bottom: [y + 1, x],
-  bottomLeft: [y + 1, x - 1],
-  left: [y, x - 1],
-  leftTop: [y - 1, x - 1],
-});
+export const getNeighbours = () => undefined;
 
 /**
killedBy: Check neighbours selectors should render with [0, 0] as coordinates value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"bottom": [1, 0], "bottomLeft": [1, -1], "left": [0, -1], "leftTop": [-1, -1], "right": [0, 1], "rightBottom": [1, 1], "top": [-1, 0], "topRight": [-1, 1]}
Received: undefined

[Killed] ObjectLiteral
src/helpers/cells/cells-manipulator.ts:8:90
  * @param { Coordinates } coords
  * @return { Record<string, [number, number]>}
  */
-export const getNeighbours = ([y, x]: Coordinates): Record<string, [number, number]> => ({
-  top: [y - 1, x],
-  topRight: [y - 1, x + 1],
-  right: [y, x + 1],
-  rightBottom: [y + 1, x + 1],
-  bottom: [y + 1, x],
-  bottomLeft: [y + 1, x - 1],
-  left: [y, x - 1],
-  leftTop: [y - 1, x - 1],
-});
+export const getNeighbours = ([y, x]: Coordinates): Record<string, [number, number]> => ({});
 
 /**
killedBy: Check neighbours selectors should render with [0, 0] as coordinates value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 34
+ Received  +  1

- Object {
-   "bottom": Array [
-     1,

[Killed] ArithmeticOperator
src/helpers/cells/cells-manipulator.ts:9:9
  * @return { Record<string, [number, number]>}
  */
 export const getNeighbours = ([y, x]: Coordinates): Record<string, [number, number]> => ({
-  top: [y - 1, x],
+  top: [y + 1, x],
   topRight: [y - 1, x + 1],
   right: [y, x + 1],
killedBy: Check neighbours selectors should render with [0, 0] as coordinates value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -22,11 +22,11 @@
    "rightBottom": Array [
      1,

[Killed] ArrayDeclaration
src/helpers/cells/cells-manipulator.ts:9:8
  * @return { Record<string, [number, number]>}
  */
 export const getNeighbours = ([y, x]: Coordinates): Record<string, [number, number]> => ({
-  top: [y - 1, x],
+  top: [],
   topRight: [y - 1, x + 1],
   right: [y, x + 1],
killedBy: Check neighbours selectors should render with [0, 0] as coordinates value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

@@ -21,14 +21,11 @@
    ],
    "rightBottom": Array [

[Killed] ArrowFunction
src/helpers/cells/cells-manipulator.ts:25:33
  * @param { Field } length
  * @return boolean
  */
-export const checkItemInField = ([y, x]: Coordinates, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+export const checkItemInField = () => undefined;
 
 export const incrementNeighbours = (coords: Coordinates, field: Field): Field => {
killedBy: checkItemField fn() test simple cases should out of y range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] LogicalOperator
src/helpers/cells/cells-manipulator.ts:26:3
  * @return boolean
  */
 export const checkItemInField = ([y, x]: Coordinates, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  y >= 0 && x >= 0 && length - y > 0 || length - x > 0;
 
 export const incrementNeighbours = (coords: Coordinates, field: Field): Field => {
killedBy: checkItemField fn() test simple cases should out of y range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/helpers/cells/cells-manipulator.ts:26:3
  * @return boolean
  */
 export const checkItemInField = ([y, x]: Coordinates, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  y >= 0 && x >= 0 || length - y > 0 && length - x > 0;
 
 export const incrementNeighbours = (coords: Coordinates, field: Field): Field => {
killedBy: checkItemField fn() test simple cases should out of y range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/helpers/cells/cells-manipulator.ts:28:82
 export const checkItemInField = ([y, x]: Coordinates, { length }: Field): boolean =>
   y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
 
-export const incrementNeighbours = (coords: Coordinates, field: Field): Field => {
-  const items = getNeighbours(coords);
-
-  for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
-
-  return field;
-};
+export const incrementNeighbours = (coords: Coordinates, field: Field): Field => {};
 
killedBy: Field Generator Simple Case should have 2x2 field with 50% probability mines(bomb)
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] BlockStatement
src/helpers/cells/cells-manipulator.ts:31:46
 export const incrementNeighbours = (coords: Coordinates, field: Field): Field => {
   const items = getNeighbours(coords);
 
-  for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
+  for (const [y, x] of Object.values(items)) {}
 
   return field;
killedBy: Field Generator Simple Case should have 2x2 field with 50% probability mines(bomb)
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] BlockStatement
src/helpers/cells/cells-manipulator.ts:32:42
   const items = getNeighbours(coords);
 
   for (const [y, x] of Object.values(items)) {
-    if (checkItemInField([y, x], field)) {
-      const cell = field[y][x];
-
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
+    if (checkItemInField([y, x], field)) {}
   }
 
killedBy: Check Increment Neighbours on each cells Simple Cases should have Field with size 2x2 with one mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,
