[Killed] BlockStatement
src/rewind/hooks/click-counter.tsx:7:81
   defaultCount?: number;
 }
 
-export const ClickCounter: FunctionComponent<Props> = ({ defaultCount = 0 }) => {
-  const [count, setCount] = useState(defaultCount);
-
-  return (
-    <div>
-      <h1>Counter: {count}</h1>
-      <button onClick={() => setCount(count + 1)}>Increase</button>
-      <button onClick={() => setCount(count - 1)}>Decrease</button>
-    </div>
-  );
-};
+export const ClickCounter: FunctionComponent<Props> = ({ defaultCount = 0 }) => {};
 
killedBy: Test ClickCounter should inc/dec counter when buttons inc/dec clicked
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, <script />, <style />
<body>
  <div />
</

[Killed] ArithmeticOperator
src/rewind/hooks/click-counter.tsx:13:39
   return (
     <div>
       <h1>Counter: {count}</h1>
-      <button onClick={() => setCount(count + 1)}>Increase</button>
+      <button onClick={() => setCount(count - 1)}>Increase</button>
       <button onClick={() => setCount(count - 1)}>Decrease</button>
     </div>
killedBy: Test ClickCounter should inc/dec counter when buttons inc/dec clicked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Counter: 1"
Received: "Counter: -1"

[Killed] ArrowFunction
src/rewind/hooks/click-counter.tsx:13:24
   return (
     <div>
       <h1>Counter: {count}</h1>
-      <button onClick={() => setCount(count + 1)}>Increase</button>
+      <button onClick={() => undefined}>Increase</button>
       <button onClick={() => setCount(count - 1)}>Decrease</button>
     </div>
killedBy: Test ClickCounter should inc/dec counter when buttons inc/dec clicked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Counter: 1"
Received: "Counter: 0"

[Killed] ArithmeticOperator
src/rewind/hooks/click-counter.tsx:14:39
     <div>
       <h1>Counter: {count}</h1>
       <button onClick={() => setCount(count + 1)}>Increase</button>
-      <button onClick={() => setCount(count - 1)}>Decrease</button>
+      <button onClick={() => setCount(count + 1)}>Decrease</button>
     </div>
   );
killedBy: Test ClickCounter should inc/dec counter when buttons inc/dec clicked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Counter: 1"
Received: "Counter: 3"

[Killed] ArrowFunction
src/rewind/hooks/click-counter.tsx:14:24
     <div>
       <h1>Counter: {count}</h1>
       <button onClick={() => setCount(count + 1)}>Increase</button>
-      <button onClick={() => setCount(count - 1)}>Decrease</button>
+      <button onClick={() => undefined}>Decrease</button>
     </div>
   );
killedBy: Test ClickCounter should inc/dec counter when buttons inc/dec clicked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Counter: 1"
Received: "Counter: 2"
