[Killed] ArrayDeclaration
minesweeper/src/helpers/mockData.ts:5:3
 
 export const MockFieldData: Field = [
   [9, 2, 9, 1, 0, 0, 1, 1, 1, 1, 1, 1],
-  [1, 2, 2, 2, 1, 0, 1, 9, 1, 1, 9, 1],
+  [],
   [0, 0, 1, 9, 10, 0, 2, 2, 2, 1, 1, 1],
   [0, 0, 10, 10, 1, 0, 1, 9, 1, 2, 2, 2],
killedBy: Grid Component rendering test should render the grid correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid Component rendering test should render the grid correctly 1`

- Snapshot  - 100
+ Received  +   0

@@ -104,110 +104,10 @@

[Killed] ArrayDeclaration
minesweeper/src/helpers/mockData.ts:7:3
   [9, 2, 9, 1, 0, 0, 1, 1, 1, 1, 1, 1],
   [1, 2, 2, 2, 1, 0, 1, 9, 1, 1, 9, 1],
   [0, 0, 1, 9, 10, 0, 2, 2, 2, 1, 1, 1],
-  [0, 0, 10, 10, 1, 0, 1, 9, 1, 2, 2, 2],
+  [],
   [0, 1, 1, 2, 2, 9, 1, 1, 1, 0, 0, 0],
   [0, 1, 9, 3, 9, 2, 10, 0, 0, 2, 1, 1],
killedBy: Grid Component rendering test should render the grid correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid Component rendering test should render the grid correctly 1`

- Snapshot  - 92
+ Received  +  0

@@ -299,102 +299,10 @@

[Killed] ArrayDeclaration
minesweeper/src/helpers/mockData.ts:11:3
   [0, 1, 1, 2, 2, 9, 1, 1, 1, 0, 0, 0],
   [0, 1, 9, 3, 9, 2, 10, 0, 0, 2, 1, 1],
   [0, 2, 2, 4, 9, 2, 10, 1, 1, 1, 9, 1],
-  [0, 1, 9, 2, 1, 1, 1, 9, 1, 2, 2, 2],
+  [],
   [0, 1, 10, 10, 0, 0, 1, 1, 1, 1, 9, 1],
   [0, 1, 10, 10, 0, 0, 1, 1, 1, 1, 9, 1],
killedBy: Grid Component rendering test should render the grid correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Grid Component rendering test should render the grid correctly 1`

- Snapshot  - 100
+ Received  +   0

@@ -683,110 +683,10 @@
