[NoCoverage] ArrowFunction
minesweeper/src/stories/Button.stories.tsx:17:49
 } as ComponentMeta<typeof Button>;
 
 // More on component templates: https://storybook.js.org/docs/react/writing-stories/introduction#using-args
-const Template: ComponentStory<typeof Button> = (args) => <Button {...args} />;
+const Template: ComponentStory<typeof Button> = () => undefined;
 
 export const Primary = Template.bind({});

[NoCoverage] StringLiteral
minesweeper/src/stories/Button.stories.tsx:40:10
 export const Small = Template.bind({});
 Small.args = {
   size: "small",
-  label: "Button",
+  label: "",
 };
 
