[NoCoverage] BlockStatement
minesweeper/src/stories/Button.tsx:31:112
 /**
  * Primary UI component for user interaction
  */
-export const Button = ({ primary = false, size = "medium", backgroundColor, label, ...props }: ButtonProps) => {
-  const mode = primary ? "storybook-button--primary" : "storybook-button--secondary";
-  return (
-    <button
-      type="button"
-      className={["storybook-button", `storybook-button--${size}`, mode].join(" ")}
-      style={{ backgroundColor }}
-      {...props}
-    >
-      {label}
-    </button>
-  );
-};
+export const Button = ({ primary = false, size = "medium", backgroundColor, label, ...props }: ButtonProps) => {};
 

[NoCoverage] ObjectLiteral
minesweeper/src/stories/Button.tsx:37:14
     <button
       type="button"
       className={["storybook-button", `storybook-button--${size}`, mode].join(" ")}
-      style={{ backgroundColor }}
+      style={{}}
       {...props}
     >
