[NoCoverage] ArrowFunction
minesweeper/src/stories/Header.stories.tsx:15:49
   },
 } as ComponentMeta<typeof Header>;
 
-const Template: ComponentStory<typeof Header> = (args) => <Header {...args} />;
+const Template: ComponentStory<typeof Header> = () => undefined;
 
 export const LoggedIn = Template.bind({});
