[NoCoverage] ArrowFunction
minesweeper/src/stories/Page.stories.tsx:16:47
   },
 } as ComponentMeta<typeof Page>;
 
-const Template: ComponentStory<typeof Page> = (args) => <Page {...args} />;
+const Template: ComponentStory<typeof Page> = () => undefined;
 
 export const LoggedOut = Template.bind({});

[NoCoverage] BlockStatement
minesweeper/src/stories/Page.stories.tsx:24:46
 
 // More on interaction testing: https://storybook.js.org/docs/react/writing-tests/interaction-testing
 // @ts-ignore
-LoggedIn.play = async ({ canvasElement }) => {
-  const canvas = within(canvasElement);
-  const loginButton = await canvas.getByRole("button", { name: /Log in/i });
-  await userEvent.click(loginButton);
-};
+LoggedIn.play = async ({ canvasElement }) => {};
 

[NoCoverage] StringLiteral
minesweeper/src/stories/Page.stories.tsx:26:46
 // @ts-ignore
 LoggedIn.play = async ({ canvasElement }) => {
   const canvas = within(canvasElement);
-  const loginButton = await canvas.getByRole("button", { name: /Log in/i });
+  const loginButton = await canvas.getByRole("", { name: /Log in/i });
   await userEvent.click(loginButton);
 };
