[NoCoverage] ArrowFunction
minesweeper/src/stories/Page.tsx:18:18
     <article>
       <Header
         user={user}
-        onLogin={() => setUser({ name: "Jane Doe" })}
+        onLogin={() => undefined}
         onLogout={() => setUser(undefined)}
         onCreateAccount={() => setUser({ name: "Jane Doe" })}

[NoCoverage] ObjectLiteral
minesweeper/src/stories/Page.tsx:18:32
     <article>
       <Header
         user={user}
-        onLogin={() => setUser({ name: "Jane Doe" })}
+        onLogin={() => setUser({})}
         onLogout={() => setUser(undefined)}
         onCreateAccount={() => setUser({ name: "Jane Doe" })}

[NoCoverage] ArrowFunction
minesweeper/src/stories/Page.tsx:19:19
       <Header
         user={user}
         onLogin={() => setUser({ name: "Jane Doe" })}
-        onLogout={() => setUser(undefined)}
+        onLogout={() => undefined}
         onCreateAccount={() => setUser({ name: "Jane Doe" })}
       />

[NoCoverage] ArrowFunction
minesweeper/src/stories/Page.tsx:20:26
         user={user}
         onLogin={() => setUser({ name: "Jane Doe" })}
         onLogout={() => setUser(undefined)}
-        onCreateAccount={() => setUser({ name: "Jane Doe" })}
+        onCreateAccount={() => undefined}
       />
 

[NoCoverage] StringLiteral
minesweeper/src/stories/Page.tsx:29:16
           We recommend building UIs with a{" "}
           <a href="https://componentdriven.org" target="_blank" rel="noopener noreferrer">
             <strong>component-driven</strong>
-          </a>{" "}
+          </a>{""}
           process starting with atomic components and ending with pages.
         </p>
