[Killed] UpdateOperator
src/helpers/field/field.ts:63:29
   let restCellsWithBombs = unprocessedCells * probability;
 
   // y = rows, x = columns
-  for (let y = 0; y < size; y++) {
+  for (let y = 0; y < size; y--) {
     for (let x = 0; x < size; x++) {
       if (restCellsWithBombs === 0) return result;
killedBy: Field Generator Simple Case should have 2x2 field with mines(bomb)
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] EqualityOperator
src/helpers/field/field.ts:63:19
   let restCellsWithBombs = unprocessedCells * probability;
 
   // y = rows, x = columns
-  for (let y = 0; y < size; y++) {
+  for (let y = 0; y >= size; y++) {
     for (let x = 0; x < size; x++) {
       if (restCellsWithBombs === 0) return result;
killedBy: Field Generator Simple Case should have a smallest possible field with mine(bomb)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ConditionalExpression
src/helpers/field/field.ts:65:11
   // y = rows, x = columns
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs === 0) return result;
+      if (true) return result;
 
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
killedBy: Field Generator Simple Case should have a smallest possible field with mine(bomb)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] EqualityOperator
src/helpers/field/field.ts:65:11
   // y = rows, x = columns
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs === 0) return result;
+      if (restCellsWithBombs !== 0) return result;
 
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
killedBy: Field Generator Simple Case should have a smallest possible field with mine(bomb)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] BlockStatement
src/helpers/field/field.ts:67:66
     for (let x = 0; x < size; x++) {
       if (restCellsWithBombs === 0) return result;
 
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeighbours([y, x], result);
-        restCellsWithBombs--;
-      }
+      if (restCellsWithBombs / unprocessedCells > Math.random()) {}
       unprocessedCells--;
     }
killedBy: Field Generator Simple Case should have a smallest possible field with mine(bomb)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] EqualityOperator
src/helpers/field/field.ts:67:11
     for (let x = 0; x < size; x++) {
       if (restCellsWithBombs === 0) return result;
 
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
+      if (restCellsWithBombs / unprocessedCells <= Math.random()) {
         result[y][x] = CellState.bomb;
         incrementNeighbours([y, x], result);
killedBy: Field Generator Simple Case should have a smallest possible field with mine(bomb)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,
